export const answersData = [
    {
        isTrue: true,
        question: 'Что такое key при рендеринге списка и для чего он нужен?\n',
        currentAnswer: 'Key помогают React определить, какие элементы были изменены, добавлены или удалены.',
    },
    {
        isTrue: true,
        question: 'Каковы различия между компонентом класса и функциональным компонентом?',
        currentAnswer: 'Компонент класса использует синтаксис класса ES6, Функциональные компоненты с хуками — это обычные JavaScript функции, которые также возвращают элементы React.',
    },
    {
        isTrue: false,
        question: 'Для чего нужно вызывать super(props)?',
        currentAnswer: 'Что бы компонент был суперским',
    },
    {
        isTrue: true,
        question: 'В чем разница между состоянием и пропсами?',
        currentAnswer: 'Состояние — это структура данных, которая начинается со значения по умолчанию при монтировании компонента. Пропсы — это конфигурация компонента. Они получены сверху из компонента родителя и неизменяемы.',
    },
    {
        isTrue: true,
        question: 'Что такое JSX?',
        currentAnswer: 'JSX - это расширение синтаксиса для JavaScript. Он создан для простого написания компонентов React.',
    },
    {
        isTrue: false,
        question: 'Что такое чистая функция?',
        currentAnswer: 'В чистой функции нет пропсов',
    },
    {
        isTrue: true,
        question: 'Как мы можем условно отрендерить JSX в React',
        currentAnswer: 'Мы можем использовать кострукции if..else, логические операторы и тернарный оператор',
    },
]
